TestingTool_3-0/src/InformationRegisters/НастройкиРаботыПользователяНаРабочемМесте/НастройкиРаботыПользователяНаРабочемМесте.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиРаботыПользователяНаРабочемМесте</name>
  <resources>
    <name>ЗначениеНастройки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючНастройки</name>
    <type>
      <types>CatalogRef.КлючиНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TestingTool_3-0/src/Catalogs/РабочиеМеста/РабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМеста</name>
  <attributes>
    <name>ОперационнаяСистема</name>
    <type>
      <types>CatalogRef.ОперационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКомпьютера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPv4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоСервер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоменноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPv6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>39</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

TestingTool_3-0/src/CommonModules/СлужебныйСервер/Module.bsl
Функция СоздатьНовоеРабочееМесто(ИмяКомпьютера,ОперационнаяСистема,КаталогПоУмолчанию,Пользователь) Экспорт
	
	РезультатОперации = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	РабочиеМеста.Ссылка
	               |ИЗ
	               |	Справочник.РабочиеМеста КАК РабочиеМеста
	               |ГДЕ
	               |	РабочиеМеста.ИмяКомпьютера = &ИмяКомпьютера";
	Запрос.УстановитьПараметр("ИмяКомпьютера",ИмяКомпьютера);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		РабочееМестоОбъект = Справочники.РабочиеМеста.СоздатьЭлемент();
		РабочееМестоОбъект.ИмяКомпьютера = ИмяКомпьютера;
		РабочееМестоОбъект.ОперационнаяСистема = ОперационнаяСистема;		
		
		Попытка
			РабочееМестоОбъект.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат Ложь;
		КонецПопытки;
		
		МенеджерНабораЗаписей = РегистрыСведений.НастройкиРаботыПользователяНаРабочемМесте.СоздатьМенеджерЗаписи();
		МенеджерНабораЗаписей.Пользователь = Пользователь;
		МенеджерНабораЗаписей.РабочееМесто = РабочееМестоОбъект.Ссылка;
		МенеджерНабораЗаписей.КлючНастройки = Справочники.КлючиНастроек.ПутьКВременномуКаталогуФайлов;
		МенеджерНабораЗаписей.ЗначениеНастройки = КаталогПоУмолчанию;
		
		МенеджерНабораЗаписей.Записать();

		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатОперации;
КонецФункции
